---
kind: other
id: Methods.T:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData
source: html/2586a63b-d7e0-539f-ab0c-0484ea79aa26.htm
---
# PipeFittingAndAccessoryData Methods

Gets the connector data of the pipe fitting or pipe accessory.